{
  "chapter1": {
    "title": "DisplayList, DisplayObject, and DisplayObjectContainer",
    "text1": "DisplayList consists of three major elements: 'Stage', 'DisplayObjectContainer', and 'DisplayObject'.",
    "text2": "'Stage' is an object that holds all 'DisplayObject'.",
    "text3": "'DisplayObjectContainer' is a 'DisplayObject' that can be used to place DisplayObjects, and it inherits from the following four classes.",
    "text4": "'DisplayObject' is an object that executes the drawing process. 9 classes inheriting from 'DisplayObject' are as follows.",
    "text5": "To add a 'DisplayObject' to a 'DisplayObjectContainer', use the addChild method of the DisplayObjectContainer."
  },
  "chapter2": {
    "title": "Adding and removing DisplayObjects from DisplayObjectContainer",
    "text1": "index is a sequentially numbered integer starting from 0, with 0 being the farthest back and higher values being the farthest forward. The index cannot be a negative value or a number greater than the current highest index plus one.",
    "text2": "addChild method adds a DisplayObject to the foremost position in the DisplayObjectContainer.",
    "text3": "addChildAt method adds a DisplayObject to the specified index position in the DisplayObjectContainer.",
    "text4": "removeChild and removeChildAt methods remove the specified DisplayObject from the DisplayObjectContainer. If there are any DisplayObjects after the removed index, they will be relocated to a smaller index position."
  },
  "chapter3": {
    "title": "Events when DisplayObjects are added to or removed from DisplayObjectContainer",
    "text1": "The added event is an Event object that is sent when a DisplayObject is added by the addChild or addChildAt function of DisplayObjectContainer.",
    "text2": "The addedToStage event is a similar event, but it is an Event object that is sent out when a DisplayObjectContainer is added to a DisplayList and displayed on the screen.",
    "text3": "The removed event is an event object that is sent when a DisplayObject is removed from a DisplayObjectContainer using the removeChild or removeChildAt function of the DisplayObjectContainer. The removed event is an event object sent when a DisplayObject is removed from the DisplayObjectContainer using the removeChild or removeChildAt function of the DisplayObjectContainer. It is also sent when a DisplayObjectContainer is moved from its existing position to a specified position using the addChild and addChildAt functions.",
    "text4": "The removedFromStage event is a similar event, but it is an Event object that is sent out when the DisplayObjectContainer is removed from the DisplayList and disappears from the screen."
  }
}
