{
  "title": "NoCode Tool How to use",
  "description": "The work space is divided into Tool Area, Screen Area, Timeline Area, and Controller Area, The functions of each area are as follows.",
  "sub-title": "How to use and sample videos",
  "tool": {
    "title": "NoCode Tool How to use | Tool Area",
    "description": "This area contains various tools and settings such as drawing tools, text tools, project loading and saving, export settings, and language settings.",
    "pen": {
      "title": "NoCode Tool 使い方 | Pen Tool",
      "description": "You can draw freehand lines, and use the Shape Transform tool to change the path freely."
    },
    "ellipse": {
      "title": "NoCode Tool How to use | Ellipse Tool",
      "description": "Use the Ellipse tool to draw a regular circle or an ellipse.",
      "text1": "To draw a line, select the tool after setting the thickness. If you set the line thickness to 0, the line will not be drawn."
    },
    "rectangle": {
      "title": "NoCode Tool How to use | Rectangle Tool",
      "description": "Using the Rectangle tool, you can draw squares and rectangles.",
      "text1": "To draw a line, select the tool after setting the thickness. If you set the line thickness to 0, the line will not be drawn."
    },
    "rounded-rectangle": {
      "title": "NoCode Tool How to use | Rounded Rectangle Tool",
      "description": "The Rounded Rectangle tool can be used to draw rounded corners and rectangles.",
      "text1": "To draw a line, select the tool after setting the thickness. If you set the line thickness to 0, the line will not be drawn."
    },
    "shape-transform": {
      "title": "NoCode Tool How to use | Shape Transform Tool",
      "description": "The square pointer controls straight lines, while the circle pointer controls curves.",
      "text1": "Double-click to add a new square pointer. Double-clicking on a square pointer will add a circle pointer to control the curve.",
      "text2": "Select either the square pointer or the circle pointer, and press the Delete button to delete the selected pointer.",
      "text3": "If you want to cut out or merge paths, select the base shape, and then select the shape you want to merge while holding down Shift on your keyboard.",
      "text4": "Finally, by clicking \"Integrating paths\" on the right-click menu, the path information will be integrated into the shape you selected as the base."
    },
    "text": {
      "title": "NoCode Tool How to use | Text Tool",
      "description": "A text area will be added by selecting the tool and specifying the range in Screen Area.",
      "text1": "Double-clicking on the created text area will switch to input mode, allowing you to insert any text.",
      "text2": "When you select a text in the Screen Area, the style information of the selected text will be displayed in the Controller Area."
    },
    "transform": {
      "title": "NoCode Tool How to use | Transform Tool",
      "description": "Allows you to stretch, rotate, or tilt the selection.",
      "text1": "Used to select an entire object. You can select multiple objects by clicking on the target object or dragging a rectangle around the object to draw a selection.",
      "text2": "By dragging the selected objects, you can move them to any x-coordinate or y-coordinate. You can also use the arrow buttons on the keyboard to move it. You can also use the arrow buttons on the keyboard to move the object, but the movement is in 1px units.",
      "text3": "Eight pointers will appear on the selected objects, the corner pointers allow you to change the xy scale, and the side pointers allow you to change the width and height values.",
      "text4": "By pressing the Rotate button and moving it left or right, you can rotate the target object.",
      "text5": "Press the Backspace or Delete button to delete the target object."
    },
    "loading": {
      "title": "Loading project data",
      "description": "You can restart the project by loading the saved data in '.n2d' format."
    },
    "save": {
      "title": "Save project data",
      "description": "Outputs the project data of the active tab in 'n2d' format."
    },
    "export": {
      "title": "Export",
      "description": "Outputs the project data of the active tab in JSON format that can be played by Player. Other formats such as animated GIFs and webm can also be exported. The export format can be selected from the settings."
    },
    "setting": {
      "title": "Setting",
      "description": "You can set the project language, export settings, etc.",
      "text1": "Hidden Layers (Not Including)",
      "description1": "Export without including layers that are set to be hidden in the timeline layers.",
      "text2": "Hidden Layers (Include)",
      "description2": "Export layers including those that are set to be hidden in the timeline layers.",
      "text3": "JSON(compression)",
      "description3": "This is a JSON file with data compressed by zlib. The compression makes the file lighter, but it may cause an overhead in decompression on the Player side.",
      "text4": "JSON(uncompressed)",
      "description4": "This is an uncompressed JSON file; no decompression overhead will be incurred on the Player side, but the data size will be large.",
      "text5": "Video(webm)",
      "description5": "Output in webm format.",
      "text6": "GIF(Animation)",
      "description6": "Output in GIF animation format.",
      "language": "You can change the display language settings."
    }
  },
  "screen": {
    "title": "NoCode Tool How to use | Screen Area",
    "description": "This is the area where you can check the drawing information such as viewing, placement, and stacking order of the DisplayObjects displayed on the Stage in the current frame. You can preview and play the Player by pressing Command+Enter or Ctrl+Enter.",
    "align": {
      "title": "NoCode Tool How to use | Align",
      "description": "The selected display object can be aligned horizontally or vertically. Vertically, it can be aligned with the right, center, or left edge of the selected display object; horizontally, it can be aligned with the top or bottom edge of the selected display object."
    },
    "layer": {
      "title": "NoCode Tool How to use | Layer",
      "description": "Allows you to control the stacking order of the displayed objects."
    },
    "tabs": {
      "title": "NoCode Tool How to use | Tabs",
      "description": "You can add or delete a new project, or specify the project you are currently working on."
    }
  },
  "timeline": {
    "title": "NoCode Tool How to use | Timeline Area",
    "description": "This is the area where you can control layers, animation keyframes, etc. You can set the Label name, embed any JavaScript in the frame, and control the addition and removal of tweens for each layer.",
    "frame-keyframe": {
      "title": "NoCode Tool How to use | Frame KeyFrame",
      "description": "The length of time is divided into frames. In the timeline, these frames are manipulated to control objects. A key frame is a frame in which a new symbol instance is displayed in the timeline. Keyframes may also contain embedded code (JavaScript) that controls the object."
    },
    "mask-layer": {
      "title": "NoCode Tool How to use | Mask Layer",
      "description": "The mask will be applied to the layer placed under the mask layer. By activating the mask layer lock, you can check the masked drawing."
    },
    "motion-tweening": {
      "title": "NoCode Tool How to use | Motion Tweening",
      "description": "Motion tweening is a type of animation that uses symbols to create movement, size and rotation changes, fades, and color effects."
    },
    "normal-layer": {
      "title": "NoCode Tool How to use | Normal Layer",
      "description": "Each layer is independent, so drawing or editing an object on one layer does not affect objects on other layers. In a stage area where there are no objects on a layer, you can see through the layer below. In addition, you can show/hide, lock/unlock, and rearrange layers."
    }
  },
  "controller": {
    "title": "NoCode Tool How to use | Controller Area",
    "description": "In this area, you can perform operations such as scaling, rotation, color manipulation, BlendMode, Filter, etc. on DisplayObjects in the screen area. The JavaScript tab allows you to view and edit the list of JavaScript embedded in the entire project.",
    "blend-mode": {
      "title": "NoCode Tool How to use | Blend Mode",
      "description": "Blending mode can be used to create compound images. Compounding is the process of changing the transparency or color interaction of multiple overlapping objects. Blending allows you to blend colors in overlapping movie clips to create unique effects."
    },
    "color-transform": {
      "title": "NoCode Tool How to use | Color Transform",
      "description": "Add and subtract red, green, blue, and transparency."
    },
    "filter": {
      "title": "NoCode Tool How to use | Filters",
      "description": "Filters can be used to add high quality visual effects to text, and movie clips. You can also use motion tweening to animate the filter you apply."
    },
    "javascript": {
      "title": "NoCode Tool How to use | JavaScript",
      "description": "It is possible to check the list of JavaScript embedded in the frame."
    },
    "object-setting": {
      "title": "NoCode Tool How to use | Object Setting",
      "description": "Set the name and symbol of the display object. The name can be accessed with this.[[name]] in javaScript, and the symbol can be used as a class."
    },
    "sound": {
      "title": "NoCode Tool How to use | Sound",
      "description": "Play the loaded sound data at any frame."
    },
    "stage-setting": {
      "title": "NoCode Tool How to use | Stage Setting",
      "description": "Set the width, height, frame rate, and background color of the display area (Stage)."
    },
    "transform": {
      "title": "NoCode Tool How to use | Transform",
      "description": "Controls the width, height, scaling, and rotation of the displayed object"
    }
  }
}