{
  "title": "NoCode Tool How to use",
  "description": "The work space is divided into Tool Area, Screen Area, Timeline Area, and Controller Area, The functions of each area are as follows.",
  "sub-title": "How to use and sample videos",
  "tool": {
    "title": "NoCode Tool How to use | Tool Area",
    "description": "This area contains various tools and settings such as drawing tools, text tools, project loading and saving, export settings, and language settings.",
    "pen": {
      "title": "NoCode Tool How to use | Pen Tool",
      "description": "You can draw freehand lines, and use the Shape Transform tool to change the path freely."
    },
    "ellipse": {
      "title": "NoCode Tool How to use | Ellipse Tool",
      "description": "Use the Ellipse tool to draw a regular circle or an ellipse.",
      "text1": "To draw a line, select the tool after setting the thickness. If you set the line thickness to 0, the line will not be drawn."
    },
    "rectangle": {
      "title": "NoCode Tool How to use | Rectangle Tool",
      "description": "Using the Rectangle tool, you can draw squares and rectangles.",
      "text1": "To draw a line, select the tool after setting the thickness. If you set the line thickness to 0, the line will not be drawn."
    },
    "rounded-rectangle": {
      "title": "NoCode Tool How to use | Rounded Rectangle Tool",
      "description": "The Rounded Rectangle tool can be used to draw rounded corners and rectangles.",
      "text1": "To draw a line, select the tool after setting the thickness. If you set the line thickness to 0, the line will not be drawn."
    },
    "shape-transform": {
      "title": "NoCode Tool How to use | Shape Transform Tool",
      "description": "The square pointer controls straight lines, while the circle pointer controls curves.",
      "text1": "Double-click to add a new square pointer. Double-clicking on a square pointer will add a circle pointer to control the curve.",
      "text2": "Select either the square pointer or the circle pointer, and press the Delete button to delete the selected pointer.",
      "text3": "If you want to cut out or merge paths, select the base shape, and then select the shape you want to merge while holding down Shift on your keyboard.",
      "text4": "Finally, by clicking \"Integrating paths\" on the right-click menu, the path information will be integrated into the shape you selected as the base."
    },
    "text": {
      "title": "NoCode Tool How to use | Text Tool",
      "description": "A text area will be added by selecting the tool and specifying the range in Screen Area.",
      "text1": "Double-clicking on the created text area will switch to input mode, allowing you to insert any text.",
      "text2": "When you select a text in the Screen Area, the style information of the selected text will be displayed in the Controller Area."
    },
    "transform": {
      "title": "NoCode Tool How to use | Transform Tool",
      "description": "Allows you to stretch, rotate, or tilt the selection.",
      "text1": "Used to select an entire object. You can select multiple objects by clicking on the target object or dragging a rectangle around the object to draw a selection.",
      "text2": "By dragging the selected objects, you can move them to any x-coordinate or y-coordinate. You can also use the arrow buttons on the keyboard to move it. You can also use the arrow buttons on the keyboard to move the object, but the movement is in 1px units.",
      "text3": "Eight pointers will appear on the selected objects, the corner pointers allow you to change the xy scale, and the side pointers allow you to change the width and height values.",
      "text4": "By pressing the Rotate button and moving it left or right, you can rotate the target object.",
      "text5": "Press the Backspace or Delete button to delete the target object."
    },
    "loading": {
      "title": "Loading project data",
      "description": "You can restart the project by loading the saved data in '.n2d' format."
    },
    "save": {
      "title": "Save project data",
      "description": "Outputs the project data of the active tab in 'n2d' format."
    },
    "export": {
      "title": "Export",
      "description": "Outputs the project data of the active tab in JSON format that can be played by Player. Other formats such as animated GIFs and webm can also be exported. The export format can be selected from the settings."
    },
    "setting": {
      "title": "Setting",
      "description": "You can set the project language, export settings, etc.",
      "text1": "Hidden Layers (Not Including)",
      "description1": "Export without including layers that are set to be hidden in the timeline layers.",
      "text2": "Hidden Layers (Include)",
      "description2": "Export layers including those that are set to be hidden in the timeline layers.",
      "text3": "JSON(compression)",
      "description3": "This is a JSON file with data compressed by zlib. The compression makes the file lighter, but it may cause an overhead in decompression on the Player side.",
      "text4": "JSON(uncompressed)",
      "description4": "This is an uncompressed JSON file; no decompression overhead will be incurred on the Player side, but the data size will be large.",
      "text5": "Video(webm)",
      "description5": "Output in webm format.",
      "text6": "GIF(Animation)",
      "description6": "Output in GIF animation format.",
      "language": "You can change the display language settings."
    }
  },
  "screen": {
    "title": "NoCode Tool How to use | Screen Area",
    "description": "This is the area where you can check the drawing information such as viewing, placement, and stacking order of the DisplayObjects displayed on the Stage in the current frame. You can preview and play the Player by pressing Command+Enter or Ctrl+Enter.",
    "align": {
      "title": "NoCode Tool How to use | Align",
      "description": "The selected display object can be aligned horizontally or vertically. Vertically, it can be aligned with the right, center, or left edge of the selected display object; horizontally, it can be aligned with the top or bottom edge of the selected display object."
    },
    "layer": {
      "title": "NoCode Tool How to use | Layer",
      "description": "Allows you to control the stacking order of the displayed objects."
    },
    "tabs": {
      "title": "NoCode Tool How to use | Tabs",
      "description": "You can add or delete a new project, or specify the project you are currently working on."
    },
    "distribute": {
      "title": "NoCode Tool How to use | Distribute to Keyframes/Layers",
      "description": "Multiple DisplayObjects selected on the screen area can be distributed to each keyframe or layer. Right-click on a DisplayObject in the screen area and select \"Distribute to Layers\" or \"Distribute to Keyframes\"."
    }
  },
  "timeline": {
    "title": "NoCode Tool How to use | Timeline Area",
    "description": "This is the area where you can control layers, animation keyframes, etc. You can set the Label name, embed any JavaScript in the frame, and control the addition and removal of tweens for each layer.",
    "frame-keyframe": {
      "title": "NoCode Tool How to use | Frame KeyFrame",
      "description": "The length of time (frames) will be divided according to the FPS value. You can control the display objects placed on the frames in the timeline. A keyframe is a frame on the timeline where a new symbol instance will be displayed. Keyframes can also embed code (JavaScript) that controls the display object."
    },
    "mask-layer": {
      "title": "NoCode Tool How to use | Mask Layer",
      "description": "The display object placed on the layer under the mask layer will be drawn as a mask. By activating the mask layer lock, you can check the masked drawing status."
    },
    "motion-tweening": {
      "title": "NoCode Tool How to use | Motion Tweening",
      "description": "Motion tweening is a type of animation that uses symbols to express movement, size and rotation changes, fades, and color effects. Curve points can be added from the right-click menu, and the added curve points can be controlled On/Off by double-clicking. If a curve point is no longer needed, it can be deleted with the delete key."
    },
    "custom-tweening": {
      "title": "NoCode Tool How to use | Custom Motion Tweening",
      "description": "Custom tweening is the ability to customize tween movement speed and other parameters using curve pointers. Pointers can be added with a double-click, and added pointers can be controlled On/Off with a double-click. Unnecessary pointers can be deleted with the Delete button."
    },
    "normal-layer": {
      "title": "NoCode Tool How to use | Normal Layer",
      "description": "Each layer is independent, and drawing or editing a display object on one layer does not affect the display objects on other layers. In the stage area where there are no display objects on a layer, you can see through the layer below. You can also show/hide, lock/unlock, and reorder layers."
    },
    "onion-skin": {
      "title": "NoCode Tool How to use | Onion Skin",
      "description": "Turning on the Onion Skin feature allows you to see the movement of the displayed object before and after the specified keyframe."
    },
    "preview": {
      "title": "NoCode Tool How to use | Preview",
      "description": "If you turn on the preview function and hover the mouse over a layer in the timeline, you can preview the drawing result of the display object placed on that layer."
    },
    "javascript": {
      "title": "NoCode Tool How to use | JavaScript",
      "description": "Like keyframes, JavaScript controls can be added on a frame-by-frame basis, mainly to make animations and movies react, and to control DisplayObjects on the timeline.",
      "text1": "NoCode Tool's JavaScript scope (this) is set to MovieClip, which executes JavaScript, as its scope. Please note that without the scope (this), it will not start correctly.",
      "text2": "Other than that, it is no different from normal JavaScript, so it can be run using either the conventional writing method or ES6 writing."
    }
  },
  "controller": {
    "title": "NoCode Tool How to use | Controller Area",
    "description": "In this area, you can perform operations such as scaling, rotation, color manipulation, BlendMode, Filter, etc. on DisplayObjects in the screen area. The JavaScript tab allows you to view and edit the list of JavaScript embedded in the entire project.",
    "blend-mode": {
      "title": "NoCode Tool How to use | Blend Mode",
      "description": "Blending mode can be used to create compound images. Compounding is the process of changing the transparency or color interaction of multiple overlapping objects. Blending allows you to blend colors in overlapping movie clips to create unique effects.",
      "normal": "The color is applied as normal and does not interact with the base color.",
      "layer": "Allows you to superimpose movie clips without affecting the color.",
      "darken": "Only areas lighter than the blend color will be replaced. Areas darker than the blend color will not be changed.",
      "multiply": "The base color and the blend color are multiplied, resulting in a darker color.",
      "lighten": "Only pixels darker than the blend color will be replaced. Areas lighter than the blend color will not be changed.",
      "screen": "The blended color will be multiplied by the inverted color and the base color, resulting in a whitening effect.",
      "overlay": "The color will be multiplied or screened depending on the base color.",
      "hardlight": "Colors will be multiplied or screened depending on the blend mode color. The effect is as if a spotlight were shining on the object.",
      "add": "It is usually used to animate a dissolve that dilutes the color between two images.",
      "subtract": "It is usually used to animate the dissolve effect, which darkens the colors between two images.",
      "difference": "Subtracts the lower brightness from the higher brightness of the base color and the blend color. This effect is similar to color inversion.",
      "invert": "The base color will be inverted.",
      "alpha": "The alpha mask will be applied.",
      "erase": "All base color pixels will be removed, including the base color of the background image."
    },
    "color-transform": {
      "title": "NoCode Tool How to use | Color Transform",
      "description": "You can adjust the color value of the display object by adding, subtracting, or multiplying red, green, blue, and transparent."
    },
    "filters": {
      "title": "NoCode Tool How to use | Filters",
      "description": "Filters can be used to add high quality visual effects to text, and movie clips. You can also use motion tweening to animate the filter you apply.",
      "DropShadow": "It simulates the appearance of an object casting a shadow on a surface. The shadow algorithm is based on the same box filter used in the Blur filter. There are multiple options for the drop shadow style, including inner shadow, outer shadow, and knockout mode.",
      "Blur": "The Blur effect blurs the details of an image. You can create a blur that looks like soft focus, or a Gaussian blur that looks hazy, as if you are viewing the image through translucent glass. If you set the quality property of this filter to low, the blur will appear to be soft-focused; if you set the quality property to high, it will resemble a Gaussian blur filter.",
      "Glow": "There are multiple options for the glow style, including inner glow, outer glow, and knockout mode. The glow filter is very similar to the drop shadow filter with the distance and angle properties set to 0.",
      "Bevel": "Apply the bevel effect to objects such as buttons to give them a three-dimensional representation. You can customize the appearance of the bevel by using different highlight colors, shadow colors, amount of bevel blur, bevel angle, bevel placement, and knockout effects.",
      "GradientGlow": "Gradation glow is a realistic glow with a controllable color gradient. Gradation glow can be applied around the inner or outer edges of an object, or on top of an object.",
      "GradientBevel": "Gradient bevels are beveled edges on the outside, inside, or top of an object, which are emphasized by a gradient color. The beveled edges give the object a three-dimensional appearance."
    },
    "javascript": {
      "title": "NoCode Tool How to use | JavaScript",
      "description": "It is possible to check the list of JavaScript embedded in the frame."
    },
    "object-setting": {
      "title": "NoCode Tool How to use | Object Setting",
      "description": "The name and symbol of the display object can be set. The name can be accessed with the JavaScript this.[[name]], and the symbol can be used as a dynamic class in conjunction with the framework."
    },
    "frame-picker": {
      "title": "NoCode Tool How to use | Frame Picker",
      "description": "The frame picker helps you visually preview and select the first frame of a MovieClip. This feature improves the user experience for animation workflows such as lip-sync."
    },
    "sound": {
      "title": "NoCode Tool How to use | Sound",
      "description": "You can place the loaded sound data on any frame. Loop and volume settings can be made for each frame."
    },
    "stage-setting": {
      "title": "NoCode Tool How to use | Stage Setting",
      "description": "Set the width, height, frame rate, and background color of the display area (Stage)."
    },
    "transform": {
      "title": "NoCode Tool How to use | Transform",
      "description": "Controls the width, height, scaling, and rotation of the displayed object."
    },
    "library": {
      "title": "NoCode Tool How to use | Library",
      "description": "You can load images (jpeg, gif, png), audio (mp3), video (mp4), and SWF files as external data. It can also manage vector diagrams, text, and movie clips created on the screen."
    }
  }
}
